import 'package:tech_blog/gen/assets.gen.dart';

import 'models.dart';

Map homePageFakeDate = {
  'imagePath': Assets.images.posterTest.path,
  'creator': 'ملیکا عزیزی',
  'createdDate': 'یک روز پیش',
  'title': 'دوازده قدم برنامه نویسی یک دوره ی...',
  'views': '253',
};

List<HashTagModel> hashTagsList = [
  HashTagModel(title: 'جاوا'),
  HashTagModel(title: 'برنامه نویس وب'),
  HashTagModel(title: 'فلاتر'),
  HashTagModel(title: 'هوش مصنوعی'),
  HashTagModel(title: 'لاراول'),
  HashTagModel(title: 'Asp.net'),
  HashTagModel(title: 'Dart'),
  HashTagModel(title: 'React Native'),
  HashTagModel(title: 'Python'),
];

Set<HashTagModel> hashTagsCategoriesSelected = {};

List<BlogModel> blogList = [
  BlogModel(
    id: 1,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-37-59.jpg",
    title: "ایلان ماسک حدود 4 میلیارد دلار از سهام تسلا را فروخت",
    creator: "جواد تاجی",
    creatorProfile: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
    createdDate: "۱ ساعت پیش",
    content: """
      بر اساس اسناد و پرونده‌های نظارتی منتشر شده، «ایلان ماسک» مدیرعامل تسلا، حدود 4.4 میلیون سهام خود از غول خودروسازی را به ارزش 4 میلیارد دلار در روز سه‌شنبه فروخته است.

طبق گزارش‌های منتشر شده، ماسک در مجموع پنج فرم 4 را به کمیسیون بورس و اوراق بهادار ایالات متحده (SEC) ارائه کرده که تمام 138 تراکنش فردی او را پوشش می‌دهد. بر اساس محاسبات TechCrunch، ارزش سهام فروخته شده، نزدیک به 4 میلیارد دلار است. به گزارش رویترز، این میزان معادل 2.6 درصد از سهام او در تسلا محسوب می‌شود
      """,
    views: "256",
  ),
  BlogModel(
    id: 2,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg",
    title: "گزارش درآمد فصل دوم سال مالی 2022 اپل منتشر شد؛ رشد 9 درصدی درآمد",
    creator: "جواد تاجی",
    creatorProfile: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
    createdDate: "۴ ساعت پیش",
    content: """

هرچند اپل همچنان با محدودیت‌های عرضه دست و پنجه نرم می‌کند، اما در گزارش درآمد سه ماهه دوم سال مالی خود، بهترین فصل منتهی به مارس را در تاریخش گزارش کرد. غول فناوری در این سه ماهه، 97.3 میلیارد دلار درآمد داشته که نسبت به مدت زمان مشابه در سال گذشته، 9 درصد افزایش یافته است. همچنین سود این شرکت 25 میلیارد دلار و سود هر سهم آن 1.52 دلار بوده است.

      """,
    views: "256",
  ),
  BlogModel(
    id: 3,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/1200-178443098-space-exploration-risks_smaller.jpg",
    title: "کاوشگران سیاره سرخ چگونه به تولید برق در مریخ می‌پردازند؟",
    creator: "مرضیه فرجی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
    createdDate: "",
    content: """
انرژی خورشیدی و انرژی هسته‌ای منابع انرژی هستند که تیم‌های کاوشگران در مریخ مورد استفاده قرار می‌دهند. کدام یک بهتر است؟ چطور می‌توان به تولید برق در مریخ پرداخت؟ دانشمندان به این سوالات پاسخ دادند.

محققان برای سفرهای خدمه مریخ به گزینه مختلف تولید انرژی را باهم مقایسه کردند: سلول‌های خورشیدی و انرژی‌ هسته‌ای رآکتورهای شکاف کوچک. یکی از ملاحظات کلیدی در این مطالعه، مقدار وزن یا جرم قابل حمل اجزای مورد نیاز است، زیرا لوازمی که در ماموریت‌های مریخ مورد استفاده قرار می‌گیرند، باید بهینه‌ترین وزن را داشته باشند. نتایج این مطالعه که در « Frontiers in Astronomy and Space Sciences» به چاپ رسید، نشان می‌دهد وابسته به موقعیت جغرافیایی روی سطح سیاره سرخ و شرایط آب و هوایی، روش‌های دست‌یابی به انرژی در مریخ متفاوت خواهد بود.

«آنتونی آبل» محقق دپارتمان مهندسی شیمی دانشگاه «برکلی» و یکی از نویسندگان این مطالعه می‌گوید: «برای تولید برق در مریخ، موقعیت کاوشگر در سطح سیاره عامل تعیین کننده است. اگر به خط استوا نزدیک باشد، استفاده از انرژی خورشیدی توصیه می‌شود و اگر به قطب‌ها نزدیک باشد، بهتر است از انرژی هسته‌ای استفاده شود.»
      """,
    views: "256",
  ),
  BlogModel(
    id: 4,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/13WELLREAD-CACIOPPO-superJumbo.jpg",
    title: "چگونه عشق بر عملکرد مغز ما تاثیر می‌گذارد؟",
    creator: "مرضیه فرجی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
    createdDate: "۱۷ ساعت پیش",
    content: """
آیا می‌توانیم بدون عشق زندگی خود را پیش ببریم؟ برای سال‌ها، «استفانی اورتیگ» عصب‌شناس، معتقد بود که پاسخ این سوال مثبت است. با وجود اینکه دکتر اورتیگ در مورد علم ارتباطات انسانی تحقیق می‌کرد، موفق شد اهمیت این ارتباطات را به صورت مستقیم در زندگی خود نیز درک کند.

او در کتاب جدید خود با عنوان « I told myself that being unattached made me a more objective researcher: I could investigate love without being under its spell» می‌نویسد: « به خودم گفتم که عدم وابستگی سبب می‌شود محققی موفق‌تر باشم، می‌توانم بدون آنکه تحت تاثیر قرار بگیرم، در مورد عشق و رابطه تحقیق کنم.»

اما سپس او در سال 2011 و در سن 37 سالگی، «جان کاچیوپو» را در یک کنفرانس علوم اعصاب در «شانگهای» ملاقات کرد. دکتر کاچیوپو، که این مفهوم را رایج کرد که تنهایی طولانی مدت می‌تواند به اندازه سیگار کشیدن برای سلامتی مضر باشد، او را به خود مجذوب کرد.

این دو دانشمند به‌طرز عجیبی در زندگی باهم آشنا شدند و سپس ازدواج کردند. آن‌ها در دانشکده پزشکی «پریتزکر» در شیکاگو با یکدیگر همکار شدند و تیم تحقیقاتی خود را در آزمایشگاه تشکیل دادند.
      """,
    views: "256",
  ),
  BlogModel(
    id: 5,
    imagePath: "https://digiato.com/wp-content/uploads/2022/04/cghjm.jpg",
    title: "ساخت اسپیکرهای فوق باریک توسط مهندسان MIT",
    creator: "آرش تهرانی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/04/elon-musk-4-90x90.jpg",
    createdDate: "ساعت پیش ۴ ",
    content: """
مهندسان دانشگاه MIT به تازگی اسپیکر فوق باریکی را ساخته‌اند که می‌توان آن را مانند کاغذدیواری روی هر سطحی نصب کرد. به گفته تیم مذکور این اسپیکرها مصرف انرژی پایینی دارند و تولید انبوه آن‌ها آسان است.

اگر بخواهیم عملکرد این اسپیکر را به زبان ساده توضیح دهیم بایست بگوییم محصول مذکور از طریق مرتعش کردن دیافراگم اسپیکر، هوای روی آن را به گردش در می‌آورد تا امواج صوتی تولید کند، امری که در باقی اسپیکرها و سیستم‌های صوتی به وسیله جریان‌های الکتریکی و میدان‌های مغناطیسی انجام می‌شود.

با این وجود دانشمندان در سال‌های اخیر توانستند با ایجاد روش‌های متفاوت، در دستگاه‌های بسیار باریک به نتایج مشابهی دست پیدا کنند. برای مثال اسپیکرهای «فیلم باریک» از مواد پیزوالکتریک استفاده می‌کنند که در پاسخ به تغییر ولتاژ مرتعش می‌شود.

مشکل اما اینجاست که این دسته از اسپیکرهای باریک یا بایست حالت ایستاده و آزاد داشته باشند، یا اینکه با کمی فاصله از سطوح دیگر در جای خود قرار بگیرند زیرا نصب کردن‌شان موجب کاهش قابلیت ارتعاش و تولید صوت در آنها می‌شود.
      """,
    views: "256",
  ),
  BlogModel(
    id: 6,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-37-59.jpg",
    title: "ایلان ماسک حدود 4 میلیارد دلار از سهام تسلا را فروخت",
    creator: "جواد تاجی",
    creatorProfile: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
    createdDate: "۱ ساعت پیش",
    content: """
      بر اساس اسناد و پرونده‌های نظارتی منتشر شده، «ایلان ماسک» مدیرعامل تسلا، حدود 4.4 میلیون سهام خود از غول خودروسازی را به ارزش 4 میلیارد دلار در روز سه‌شنبه فروخته است.

طبق گزارش‌های منتشر شده، ماسک در مجموع پنج فرم 4 را به کمیسیون بورس و اوراق بهادار ایالات متحده (SEC) ارائه کرده که تمام 138 تراکنش فردی او را پوشش می‌دهد. بر اساس محاسبات TechCrunch، ارزش سهام فروخته شده، نزدیک به 4 میلیارد دلار است. به گزارش رویترز، این میزان معادل 2.6 درصد از سهام او در تسلا محسوب می‌شود
      """,
    views: "256",
  ),
  BlogModel(
    id: 7,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg",
    title: "گزارش درآمد فصل دوم سال مالی 2022 اپل منتشر شد؛ رشد 9 درصدی درآمد",
    creator: "جواد تاجی",
    creatorProfile: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
    createdDate: "۴ ساعت پیش",
    content: """

هرچند اپل همچنان با محدودیت‌های عرضه دست و پنجه نرم می‌کند، اما در گزارش درآمد سه ماهه دوم سال مالی خود، بهترین فصل منتهی به مارس را در تاریخش گزارش کرد. غول فناوری در این سه ماهه، 97.3 میلیارد دلار درآمد داشته که نسبت به مدت زمان مشابه در سال گذشته، 9 درصد افزایش یافته است. همچنین سود این شرکت 25 میلیارد دلار و سود هر سهم آن 1.52 دلار بوده است.

      """,
    views: "256",
  ),
  BlogModel(
    id: 8,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/1200-178443098-space-exploration-risks_smaller.jpg",
    title: "کاوشگران سیاره سرخ چگونه به تولید برق در مریخ می‌پردازند؟",
    creator: "مرضیه فرجی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
    createdDate: "",
    content: """
انرژی خورشیدی و انرژی هسته‌ای منابع انرژی هستند که تیم‌های کاوشگران در مریخ مورد استفاده قرار می‌دهند. کدام یک بهتر است؟ چطور می‌توان به تولید برق در مریخ پرداخت؟ دانشمندان به این سوالات پاسخ دادند.

محققان برای سفرهای خدمه مریخ به گزینه مختلف تولید انرژی را باهم مقایسه کردند: سلول‌های خورشیدی و انرژی‌ هسته‌ای رآکتورهای شکاف کوچک. یکی از ملاحظات کلیدی در این مطالعه، مقدار وزن یا جرم قابل حمل اجزای مورد نیاز است، زیرا لوازمی که در ماموریت‌های مریخ مورد استفاده قرار می‌گیرند، باید بهینه‌ترین وزن را داشته باشند. نتایج این مطالعه که در « Frontiers in Astronomy and Space Sciences» به چاپ رسید، نشان می‌دهد وابسته به موقعیت جغرافیایی روی سطح سیاره سرخ و شرایط آب و هوایی، روش‌های دست‌یابی به انرژی در مریخ متفاوت خواهد بود.

«آنتونی آبل» محقق دپارتمان مهندسی شیمی دانشگاه «برکلی» و یکی از نویسندگان این مطالعه می‌گوید: «برای تولید برق در مریخ، موقعیت کاوشگر در سطح سیاره عامل تعیین کننده است. اگر به خط استوا نزدیک باشد، استفاده از انرژی خورشیدی توصیه می‌شود و اگر به قطب‌ها نزدیک باشد، بهتر است از انرژی هسته‌ای استفاده شود.»
      """,
    views: "256",
  ),
  BlogModel(
    id: 9,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/13WELLREAD-CACIOPPO-superJumbo.jpg",
    title: "چگونه عشق بر عملکرد مغز ما تاثیر می‌گذارد؟",
    creator: "مرضیه فرجی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
    createdDate: "۱۷ ساعت پیش",
    content: """
آیا می‌توانیم بدون عشق زندگی خود را پیش ببریم؟ برای سال‌ها، «استفانی اورتیگ» عصب‌شناس، معتقد بود که پاسخ این سوال مثبت است. با وجود اینکه دکتر اورتیگ در مورد علم ارتباطات انسانی تحقیق می‌کرد، موفق شد اهمیت این ارتباطات را به صورت مستقیم در زندگی خود نیز درک کند.

او در کتاب جدید خود با عنوان « I told myself that being unattached made me a more objective researcher: I could investigate love without being under its spell» می‌نویسد: « به خودم گفتم که عدم وابستگی سبب می‌شود محققی موفق‌تر باشم، می‌توانم بدون آنکه تحت تاثیر قرار بگیرم، در مورد عشق و رابطه تحقیق کنم.»

اما سپس او در سال 2011 و در سن 37 سالگی، «جان کاچیوپو» را در یک کنفرانس علوم اعصاب در «شانگهای» ملاقات کرد. دکتر کاچیوپو، که این مفهوم را رایج کرد که تنهایی طولانی مدت می‌تواند به اندازه سیگار کشیدن برای سلامتی مضر باشد، او را به خود مجذوب کرد.

این دو دانشمند به‌طرز عجیبی در زندگی باهم آشنا شدند و سپس ازدواج کردند. آن‌ها در دانشکده پزشکی «پریتزکر» در شیکاگو با یکدیگر همکار شدند و تیم تحقیقاتی خود را در آزمایشگاه تشکیل دادند.
      """,
    views: "256",
  ),
  BlogModel(
    id: 10,
    imagePath: "https://digiato.com/wp-content/uploads/2022/04/cghjm.jpg",
    title: "ساخت اسپیکرهای فوق باریک توسط مهندسان MIT",
    creator: "آرش تهرانی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/04/elon-musk-4-90x90.jpg",
    createdDate: "ساعت پیش ۴ ",
    content: """
مهندسان دانشگاه MIT به تازگی اسپیکر فوق باریکی را ساخته‌اند که می‌توان آن را مانند کاغذدیواری روی هر سطحی نصب کرد. به گفته تیم مذکور این اسپیکرها مصرف انرژی پایینی دارند و تولید انبوه آن‌ها آسان است.

اگر بخواهیم عملکرد این اسپیکر را به زبان ساده توضیح دهیم بایست بگوییم محصول مذکور از طریق مرتعش کردن دیافراگم اسپیکر، هوای روی آن را به گردش در می‌آورد تا امواج صوتی تولید کند، امری که در باقی اسپیکرها و سیستم‌های صوتی به وسیله جریان‌های الکتریکی و میدان‌های مغناطیسی انجام می‌شود.

با این وجود دانشمندان در سال‌های اخیر توانستند با ایجاد روش‌های متفاوت، در دستگاه‌های بسیار باریک به نتایج مشابهی دست پیدا کنند. برای مثال اسپیکرهای «فیلم باریک» از مواد پیزوالکتریک استفاده می‌کنند که در پاسخ به تغییر ولتاژ مرتعش می‌شود.

مشکل اما اینجاست که این دسته از اسپیکرهای باریک یا بایست حالت ایستاده و آزاد داشته باشند، یا اینکه با کمی فاصله از سطوح دیگر در جای خود قرار بگیرند زیرا نصب کردن‌شان موجب کاهش قابلیت ارتعاش و تولید صوت در آنها می‌شود.
      """,
    views: "256",
  ),
  BlogModel(
    id: 11,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-37-59.jpg",
    title: "ایلان ماسک حدود 4 میلیارد دلار از سهام تسلا را فروخت",
    creator: "جواد تاجی",
    creatorProfile: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
    createdDate: "۱ ساعت پیش",
    content: """
      بر اساس اسناد و پرونده‌های نظارتی منتشر شده، «ایلان ماسک» مدیرعامل تسلا، حدود 4.4 میلیون سهام خود از غول خودروسازی را به ارزش 4 میلیارد دلار در روز سه‌شنبه فروخته است.

طبق گزارش‌های منتشر شده، ماسک در مجموع پنج فرم 4 را به کمیسیون بورس و اوراق بهادار ایالات متحده (SEC) ارائه کرده که تمام 138 تراکنش فردی او را پوشش می‌دهد. بر اساس محاسبات TechCrunch، ارزش سهام فروخته شده، نزدیک به 4 میلیارد دلار است. به گزارش رویترز، این میزان معادل 2.6 درصد از سهام او در تسلا محسوب می‌شود
      """,
    views: "256",
  ),
  BlogModel(
    id: 12,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/photo_2022-04-29_09-06-13.jpg",
    title: "گزارش درآمد فصل دوم سال مالی 2022 اپل منتشر شد؛ رشد 9 درصدی درآمد",
    creator: "جواد تاجی",
    creatorProfile: "https://digiato.com/wp-content/uploads/2021/02/1-30.jpg",
    createdDate: "۴ ساعت پیش",
    content: """

هرچند اپل همچنان با محدودیت‌های عرضه دست و پنجه نرم می‌کند، اما در گزارش درآمد سه ماهه دوم سال مالی خود، بهترین فصل منتهی به مارس را در تاریخش گزارش کرد. غول فناوری در این سه ماهه، 97.3 میلیارد دلار درآمد داشته که نسبت به مدت زمان مشابه در سال گذشته، 9 درصد افزایش یافته است. همچنین سود این شرکت 25 میلیارد دلار و سود هر سهم آن 1.52 دلار بوده است.

      """,
    views: "256",
  ),
  BlogModel(
    id: 13,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/1200-178443098-space-exploration-risks_smaller.jpg",
    title: "کاوشگران سیاره سرخ چگونه به تولید برق در مریخ می‌پردازند؟",
    creator: "مرضیه فرجی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
    createdDate: "",
    content: """
انرژی خورشیدی و انرژی هسته‌ای منابع انرژی هستند که تیم‌های کاوشگران در مریخ مورد استفاده قرار می‌دهند. کدام یک بهتر است؟ چطور می‌توان به تولید برق در مریخ پرداخت؟ دانشمندان به این سوالات پاسخ دادند.

محققان برای سفرهای خدمه مریخ به گزینه مختلف تولید انرژی را باهم مقایسه کردند: سلول‌های خورشیدی و انرژی‌ هسته‌ای رآکتورهای شکاف کوچک. یکی از ملاحظات کلیدی در این مطالعه، مقدار وزن یا جرم قابل حمل اجزای مورد نیاز است، زیرا لوازمی که در ماموریت‌های مریخ مورد استفاده قرار می‌گیرند، باید بهینه‌ترین وزن را داشته باشند. نتایج این مطالعه که در « Frontiers in Astronomy and Space Sciences» به چاپ رسید، نشان می‌دهد وابسته به موقعیت جغرافیایی روی سطح سیاره سرخ و شرایط آب و هوایی، روش‌های دست‌یابی به انرژی در مریخ متفاوت خواهد بود.

«آنتونی آبل» محقق دپارتمان مهندسی شیمی دانشگاه «برکلی» و یکی از نویسندگان این مطالعه می‌گوید: «برای تولید برق در مریخ، موقعیت کاوشگر در سطح سیاره عامل تعیین کننده است. اگر به خط استوا نزدیک باشد، استفاده از انرژی خورشیدی توصیه می‌شود و اگر به قطب‌ها نزدیک باشد، بهتر است از انرژی هسته‌ای استفاده شود.»
      """,
    views: "256",
  ),
  BlogModel(
    id: 14,
    imagePath:
        "https://digiato.com/wp-content/uploads/2022/04/13WELLREAD-CACIOPPO-superJumbo.jpg",
    title: "چگونه عشق بر عملکرد مغز ما تاثیر می‌گذارد؟",
    creator: "مرضیه فرجی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/02/10897985_639437109516078_4342420382567329691_n-300x300.jpg",
    createdDate: "۱۷ ساعت پیش",
    content: """
آیا می‌توانیم بدون عشق زندگی خود را پیش ببریم؟ برای سال‌ها، «استفانی اورتیگ» عصب‌شناس، معتقد بود که پاسخ این سوال مثبت است. با وجود اینکه دکتر اورتیگ در مورد علم ارتباطات انسانی تحقیق می‌کرد، موفق شد اهمیت این ارتباطات را به صورت مستقیم در زندگی خود نیز درک کند.

او در کتاب جدید خود با عنوان « I told myself that being unattached made me a more objective researcher: I could investigate love without being under its spell» می‌نویسد: « به خودم گفتم که عدم وابستگی سبب می‌شود محققی موفق‌تر باشم، می‌توانم بدون آنکه تحت تاثیر قرار بگیرم، در مورد عشق و رابطه تحقیق کنم.»

اما سپس او در سال 2011 و در سن 37 سالگی، «جان کاچیوپو» را در یک کنفرانس علوم اعصاب در «شانگهای» ملاقات کرد. دکتر کاچیوپو، که این مفهوم را رایج کرد که تنهایی طولانی مدت می‌تواند به اندازه سیگار کشیدن برای سلامتی مضر باشد، او را به خود مجذوب کرد.

این دو دانشمند به‌طرز عجیبی در زندگی باهم آشنا شدند و سپس ازدواج کردند. آن‌ها در دانشکده پزشکی «پریتزکر» در شیکاگو با یکدیگر همکار شدند و تیم تحقیقاتی خود را در آزمایشگاه تشکیل دادند.
      """,
    views: "256",
  ),
  BlogModel(
    id: 15,
    imagePath: "https://digiato.com/wp-content/uploads/2022/04/cghjm.jpg",
    title: "ساخت اسپیکرهای فوق باریک توسط مهندسان MIT",
    creator: "آرش تهرانی",
    creatorProfile:
        "https://digiato.com/wp-content/uploads/2022/04/elon-musk-4-90x90.jpg",
    createdDate: "ساعت پیش ۴ ",
    content: """
مهندسان دانشگاه MIT به تازگی اسپیکر فوق باریکی را ساخته‌اند که می‌توان آن را مانند کاغذدیواری روی هر سطحی نصب کرد. به گفته تیم مذکور این اسپیکرها مصرف انرژی پایینی دارند و تولید انبوه آن‌ها آسان است.

اگر بخواهیم عملکرد این اسپیکر را به زبان ساده توضیح دهیم بایست بگوییم محصول مذکور از طریق مرتعش کردن دیافراگم اسپیکر، هوای روی آن را به گردش در می‌آورد تا امواج صوتی تولید کند، امری که در باقی اسپیکرها و سیستم‌های صوتی به وسیله جریان‌های الکتریکی و میدان‌های مغناطیسی انجام می‌شود.

با این وجود دانشمندان در سال‌های اخیر توانستند با ایجاد روش‌های متفاوت، در دستگاه‌های بسیار باریک به نتایج مشابهی دست پیدا کنند. برای مثال اسپیکرهای «فیلم باریک» از مواد پیزوالکتریک استفاده می‌کنند که در پاسخ به تغییر ولتاژ مرتعش می‌شود.

مشکل اما اینجاست که این دسته از اسپیکرهای باریک یا بایست حالت ایستاده و آزاد داشته باشند، یا اینکه با کمی فاصله از سطوح دیگر در جای خود قرار بگیرند زیرا نصب کردن‌شان موجب کاهش قابلیت ارتعاش و تولید صوت در آنها می‌شود.
      """,
    views: "256",
  ),
  BlogModel(
    id: 16,
    imagePath: "",
    title: "",
    creator: "",
    creatorProfile: "",
    createdDate: "",
    content: """
      """,
    views: "256",
  )
];

List<PodcastModel> podcastList = [
  PodcastModel(
    id: 1,
    imageUrl:
        'https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/19/0b/43/190b43a1-8049-a2f5-63f6-6ecc6325cc28/mza_17628134532651742707.jpg/400x400bb.jpg',
    title: 'پادکست رخ',
  ),
  PodcastModel(
    id: 2,
    imageUrl:
        'https://tehranpodcast.ir/wp-content/uploads/2020/09/9061830-1600580901613-4facd1a4980a3.jpg',
    title: 'جا فکری',
  ),
  PodcastModel(
    id: 3,
    imageUrl:
        'https://deow9bq0xqvbj.cloudfront.net/image-logo/3377250/HelliTalk_Podcast-01-resized.png',
    title: 'هلی تاک',
  ),
  PodcastModel(
    id: 4,
    imageUrl:
        'https://deow9bq0xqvbj.cloudfront.net/image-logo/14012996/3387942-1638971195865-e7f43246348cd.jpg',
    title: 'کتابگرد',
  ),
  PodcastModel(
    id: 5,
    imageUrl:
        'https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/00/31/4c/00314cb7-6716-d77a-d134-673ca137f476/mza_12390173946242352654.jpg/400x400bb.jpg',
    title: 'رادیو راه',
  ),
];
